{
    "page_content": "Here is the modified document:\n\nThe values of the considered feature are calculated using different imputation methods. We begin by handling missing values in features with complete records, where we fill missing categorical variables with their mode and continuous variables with their mean. In addition to this approach, we investigate four single imputation techniques. The first method employed is softImpute (10), which involves fitting a low-rank matrix approximation to the dataset containing missing values for numeric variables; for categorical variables, missing values are filled with the most frequent value (mode). Next, we use missForest (11) - a model that predicts missing values based on random forest regression trained on complete observations. Both numeric and categorical features can be handled using this method. We also utilize two imputation methods from the VIM package: kknn (13), which is a k-Nearest Neighbour algorithm applicable to both numerical and categorical variables, and hotdeck (13), a sequential, random hot-deck imputation strategy for handling missing values in various types of features. Furthermore, we incorporate mice (10) as an example of multiple imputation techniques - by default, this package uses predictive mean matching for continuous features and polytomous logistic regression for categorical ones. It is worth noting that some methods require parameter tuning; however, in our benchmark, we relied on their default settings. The reproducible scripts used in the study can be accessed through https://github.com/ModelOriented/EMMA. We experimented with Amelia and missMDA but encountered issues during data imputation for most datasets - as a result, they were excluded from the assessment. To ensure authenticity, we apply imputation methods to the training dataset before evaluating their performance, thus avoiding any potential data leakage when simulating real-world applications.",
    "metadata": {
        "source": "../../data/pdfs\\JP_2007.02837v1.pdf",
        "chunk_idx": 6
    }
}