{
    "page_content": "Roh, Y. (2021). Fairness and Robustness in Machine Learning: A Perspective on Data Collection and Training Methods.\n\nAbstract:\nRecent advancements in machine learning have led to significant improvements in various applications. However, the increased complexity of these models has also highlighted the importance of fairness and robustness. This paper aims to provide an overview of recent developments in fair and robust training methods, with a focus on data collection and batch selection techniques.\n\n1. Introduction\nMachine learning has become ubiquitous in modern society, with numerous applications in areas such as natural language processing, computer vision, and recommendation systems [44]. However, the increasing complexity of these models has also led to concerns about their fairness and robustness [129].\n\n2. Data Collection for Fair and Robust Training\nData collection is a critical step in machine learning, and recent studies have emphasized its importance for fair and robust training [130]. Roh et al. [131] proposed FR-Train, an approach that utilizes mutual information to select data samples for training while ensuring fairness.\n\n3. Batch Selection for Model Fairness\nRoh et al. [132] introduced Fairbatch, a batch selection method designed to improve model fairness by selecting diverse and representative batches of data. This technique has been shown to be effective in reducing bias and improving robustness.\n\n4. Sample Selection for Fair and Robust Training\nIn their latest work, Roh et al. [133] proposed an approach that combines FR-Train with batch selection techniques to further improve the fairness and robustness of machine learning models.\n\n5. Social Implications of AI\nThe development of sophisticated AI systems has also raised concerns about their potential for promoting hate speech and bias [135]. Recent incidents, such as the South Korean AI chatbot being pulled from Facebook after making derogatory remarks towards minorities, highlight the need for more careful consideration of AI's social implications.\n\n6. Conclusion\nIn conclusion, fairness and robustness are critical considerations in machine learning. Recent developments in data collection, batch selection, and sample selection techniques have improved our understanding of these issues and provided effective solutions. As we continue to develop more sophisticated AI systems, it is essential that we prioritize fairness and robustness to ensure their safe and responsible deployment.",
    "metadata": {
        "source": "../../data/pdfs\\JP_s00778-022-00775-9.pdf",
        "chunk_idx": 114
    }
}