{
    "page_content": "Can We Rely on Bootstrap in High Dimensions?\n\n**Abstract**\n\nThe bootstrap is a widely used resampling technique that has become an indispensable tool in statistical analysis. However, its performance in high-dimensional data remains unclear. In this study, we investigate the reliability of the bootstrap in detecting the optimal model for scaled predicted errors.\n\n**Introduction**\n\nHigh-dimensional data pose significant challenges to statistical inference. One major issue is the curse of dimensionality, which makes it difficult to determine whether observed effects are due to chance or real patterns. The bootstrap is a popular method used to assess the accuracy of estimators and confidence intervals in various settings. However, its performance in high dimensions remains poorly understood.\n\n**Results**\n\nOur analysis focuses on the relative risk of convolved data (Gconv) compared to original data (G), as well as the comparison between Gconv and normal distribution data (Gnorm). The results are presented in Figure 3(a) and (b).\n\nFigure 3(a): Relative Risk of ˆβ for scaled predicted errors vs. original errors - population version\n\nThe ratios of average risk of Gconv to G are plotted, showing a clear increase in relative risk as the ratio p/n increases.\n\n0.0 0.2 0.4 0.6 0.8\n1.00 1.02 1.04 1.06 1.08 1.10 1.12\np/n\nRelative Risk\n\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n●\n\n(a) Relative risk of Gconv to G\n\nFigure 3(b): Relative risk of Gconv and Gnorm to G\n\nThe ratios of average risk of Gconv and Gnorm to G are plotted, showing a consistent increase in relative risk as the ratio p/n increases.\n\n0.0 0.2 0.4 0.6 0.8\n1.0 1.1 1.2 1.3 1.4 1.5 1.6\np/n\nRelative Risk\n\n● ●●●●●●●●●●●●●●●●\n●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●\n\n**Discussion**\n\nOur results indicate that the bootstrap may not be entirely reliable in high dimensions, particularly when dealing with scaled predicted errors. The relative risk of convolved data compared to original data increases significantly as the ratio p/n grows. This suggests that the bootstrap may overestimate or underestimate the accuracy of estimators in high-dimensional settings.\n\n**Conclusion**\n\nWhile the bootstrap remains a valuable tool for statistical analysis, our findings highlight its limitations in high dimensions. Future research should investigate alternative methods for assessing model performance and developing more robust resampling techniques.\n\nReferences:",
    "metadata": {
        "source": "../../data/pdfs\\KS_can_we_trust_in_bootstrap.pdf",
        "chunk_idx": 57
    }
}